app/controllers/agendas_controller.rb

  def index
    @agendas = Agenda.where('datahora_inicio >= ?', Time.now).order(:datahora_inicio)
---
SELECT `agendas`.* FROM `agendas` WHERE (datahora_inicio >= '2022-07-04 17:04:00.705897') ORDER BY `agendas`.`datahora_inicio` ASC

  def create
    @agenda = Agenda.new(agenda_params)

    respond_to do |format|
      if @agenda.save
---
INSERT INTO `agendas` (`titulo`, `descricao`, `datahora_inicio`, `datahora_termino`, `vagas`, `valor`, `link_inscricao`, `created_at`, `updated_at`) VALUES ('120 Day', 'Um dia de avivamento onde traremos a realidade dos céus para terra.\nUm novo ano, novas expectativas, a busca pela mudança.\nA busca não para, a intensidade pelo poder aumenta.\nUm amigo íntimo e especial, uma presença essencial, um relacionamento sobrenatural com o Espírito Santo.\nVocê já o conhece? Você já foi batizado por ele? Você já entrou na intimidade?\nEntão venha conhece-lo, será sobrenatural, um dia de ministrações intensas, mudança através da PALAVRA, ADORAÇÃO extravagante, PODER através da intimidade.\nEntão anote essa data na sua agenda!\n\nTe esperamos!', '2022-07-09 16:00:00', '2022-07-09 21:00:00', 120, 30.0, 'https://buy.stripe.com/9AQ3eseRj8cugKY9AA', '2022-07-01 14:31:28.907817', '2022-07-01 14:31:28.907817')

  def update
    respond_to do |format|
      if @agenda.update(agenda_params)
---
UPDATE `agendas` SET `agendas`.`descricao` = 'Um dia de avivamento onde traremos a realidade dos céus para terra.\r\nUm novo ano, novas expectativas, a busca pela mudança.\r\nA busca não para, a intensidade pelo poder aumenta.\r\nUm amigo íntimo e especial, uma presença essencial, um relacionamento sobrenatural com o Espírito Santo.\r\nVocê já o conhece? Você já foi batizado por ele? Você já entrou na intimidade?\r\nEntão venha conhece-lo, será sobrenatural, um dia de ministrações intensas, mudança através da PALAVRA, ADORAÇÃO extravagante, PODER através da intimidade.\r\nEntão anote essa data na sua agenda!\r\n\r\nTe esperamos!', `agendas`.`updated_at` = '2022-07-01 14:54:26.426572' WHERE `agendas`.`id` = 1

    def set_agenda
      @agenda = Agenda.find(params[:id])
---
SELECT `agendas`.* FROM `agendas` WHERE `agendas`.`id` = 1 LIMIT 1