app/controllers/apresentacaos_controller.rb

SELECT `apresentacaos`.* FROM `apresentacaos`
---
  def index
    @apresentacaos = Apresentacao.all