app/controllers/estatisticas_controller.rb

  def create
    @estatistica = Estatistica.new(estatistica_params)

    respond_to do |format|
      if @estatistica.save
---
INSERT INTO `estatisticas` (`tema_culto`, `data_culto`, `total_presentes`, `total_visitantes`, `total_conversoes`, `total_aliancados`, `total_batismos`, `total_criancas`, `observacoes`, `created_at`, `updated_at`) VALUES ('Festa de Pentecostes', '2024-06-02', 0, 0, 2, NULL, NULL, 0, '', '2024-06-04 13:50:47.228511', '2024-06-04 13:50:47.228511')

  def update
    respond_to do |format|
      if @estatistica.update(estatistica_params)
---
UPDATE `estatisticas` SET `estatisticas`.`total_aliancados` = 12, `estatisticas`.`total_batismos` = 7, `estatisticas`.`updated_at` = '2024-06-04 14:24:26.392747' WHERE `estatisticas`.`id` = 1

    def set_estatistica
      @estatistica = Estatistica.find(params[:id])
---
SELECT `estatisticas`.* FROM `estatisticas` WHERE `estatisticas`.`id` = 1 LIMIT 1