app/controllers/membros_controller.rb

SELECT `membros`.* FROM `membros`
---
  def index
    @membros = Membro.all

INSERT INTO `membros` (`nome`, `sobrenome`, `telefone`, `endereco`, `bairro`, `cidade`, `data_nascimento`, `email`, `data_alianca`, `data_batismo`, `data_desligamento`, `observacoes`, `situacao`, `created_at`, `updated_at`) VALUES ('Rosemery', 'Ribeiro', '24988818402', 'Rua Prefeito Antonio Caramez', 'Santa Rita', 'Mendes', '1964-07-07', '', NULL, NULL, NULL, '', 1, '2022-07-07 16:22:05.010648', '2022-07-07 16:22:05.010648')
---
  def create
    @membro = Membro.new(membro_params)

    respond_to do |format|
      if @membro.save

UPDATE `membros` SET `membros`.`nome` = 'Rosimeri', `membros`.`sobrenome` = 'Ribeiro Silva', `membros`.`updated_at` = '2022-07-07 20:17:49.857847' WHERE `membros`.`id` = 2
---
  def update
    respond_to do |format|
      if @membro.update(membro_params)

SELECT `membros`.* FROM `membros` WHERE `membros`.`id` = 1 LIMIT 1
---
    def set_membro
      @membro = Membro.find(params[:id])