app/controllers/pessoas_controller.rb

  def index
    @pessoas = Pessoa.all
---
SELECT `pessoas`.* FROM `pessoas`

  def create
    @pessoa = Pessoa.new(pessoa_params)

    respond_to do |format|
      if @pessoa.save
---
INSERT INTO `pessoas` (`nome`, `sobrenome`, `nome_pai`, `nome_mae`, `telefone`, `data_nascimento`, `endereco`, `bairro`, `cidade`, `estado`, `cep`, `email`, `created_at`, `updated_at`, `sexo`) VALUES ('Luiz Cláudio', 'de Castro Figueredo', 'Joaquim Monteiro de Figueredo', 'Ilma de Castro Figueredo', '24981565684', '1968-03-07', 'Travessa Casa Branca, 126', 'Ramalho', 'Engenheiro Paulo de Frontin', 'RJ', '26650-000', 'luiz@llkinformatica.com.br', '2022-07-08 15:28:22.589882', '2022-07-08 15:28:22.589882', NULL)

  def update
    respond_to do |format|
      if @pessoa.update(pessoa_params)
---
UPDATE `pessoas` SET `pessoas`.`telefone` = '(24) 98156-5684', `pessoas`.`updated_at` = '2022-07-08 16:35:21.044805' WHERE `pessoas`.`id` = 1

    def set_pessoa
      @pessoa = Pessoa.find(params[:id])
---
SELECT `pessoas`.* FROM `pessoas` WHERE `pessoas`.`id` = 1 LIMIT 1