app/controllers/tipo_eventos_controller.rb

SELECT `tipo_eventos`.* FROM `tipo_eventos`
---
  def index
    @tipo_eventos = TipoEvento.all

INSERT INTO `tipo_eventos` (`descricao`, `created_at`, `updated_at`) VALUES ('Visita', '2022-07-08 11:09:56.770987', '2022-07-08 11:09:56.770987')
---
  def create
    @tipo_evento = TipoEvento.new(tipo_evento_params)

    respond_to do |format|
      if @tipo_evento.save

SELECT `tipo_eventos`.* FROM `tipo_eventos` WHERE `tipo_eventos`.`id` = 1 LIMIT 1
---
    def set_tipo_evento
      @tipo_evento = TipoEvento.find(params[:id])