app/controllers/visitantes_controller.rb

SELECT `visitantes`.* FROM `visitantes` WHERE (nome ILIKE '%#{params[:query]%')
---
  def index
    @visitantes = Visitante.all

INSERT INTO `visitantes` (`nome`, `sobrenome`, `telefone`, `grupo`, `observacoes`, `created_at`, `updated_at`) VALUES ('Alexsandra', 'Antunes da Silva Figueredo', '24999419163', 1, '', '2022-06-17 13:34:12.221337', '2022-06-17 13:34:12.221337')
---
  def create
    @visitante = Visitante.new(visitante_params)

    respond_to do |format|
      if @visitante.save

UPDATE `visitantes` SET `visitantes`.`sobrenome` = 'Antunes da S. Figueredo', `visitantes`.`updated_at` = '2022-06-17 19:02:56.566996' WHERE `visitantes`.`id` = 5
---
  def update
    respond_to do |format|
      if @visitante.update(visitante_params)

DELETE FROM `visitantes` WHERE `visitantes`.`id` = 3
SELECT `visitantes`.* FROM `visitantes`
---
  def destroy
    @visitante.destroy

    respond_to do |format|
      format.html { redirect_to visitantes_url, notice: "Visitante was successfully destroyed." }
      format.json { render json: Visitante.all, status: :ok }

SELECT `visitantes`.* FROM `visitantes` WHERE `visitantes`.`id` = 1 LIMIT 1
---
    def set_visitante
      @visitante = Visitante.find(params[:id])