app/controllers/visitantes_controller.rb

    def set_visitante
      @visitante = Visitante.find(params[:id])
---
SELECT `visitantes`.* FROM `visitantes` WHERE `visitantes`.`id` = 65 LIMIT 1