app/controllers/welcome_controller.rb

SELECT `estatisticas`.* FROM `estatisticas` ORDER BY `estatisticas`.`created_at` DESC LIMIT 6
---
  def index
      @estatisticas = Estatistica.all.limit(6).order(created_at: :desc)